tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1827_tdd.h
#define DC1B0                         522
#define DC1B1                         523
#define P1M                           524
#define P1M0                          525
#define P1M1                          526
#define PWM1CON                       527
#define P1DC                          528
#define P1DC0                         529
#define P1DC1                         530
#define P1DC2                         531
#define P1DC3                         532
#define P1DC4                         533
#define P1DC5                         534
#define P1DC6                         535
#define P1RSEN                        536
#define PSS1BD                        537
#define PSS1BD0                       538
#define PSS1BD1                       539
#define PSS1AC                        540
#define PSS1AC0                       541
#define PSS1AC1                       542
#define CCP1AS                        543
#define CCP1AS0                       544
#define CCP1AS1                       545
#define CCP1AS2                       546
#define CCP1ASE                       547
#define PSTR1CON                      548
#define STR1A                         549
#define STR1B                         550
#define STR1C                         551
#define STR1D                         552
#define STR1SYNC                      553
#define CCPR2L                        554
#define CCPR2H                        555
#define CCP2CON                       556
#define CCP2M                         557
#define CCP2M0                        558
#define CCP2M1                        559
#define CCP2M2                        560
#define CCP2M3                        561
#define DC2B                          562
#define DC2B0                         563
#define DC2B1                         564
#define P2M                           565
#define P2M0                          566
#define P2M1                          567
#define PWM2CON                       568
#define P2DC                          569
#define P2DC0                         570
#define P2DC1                         571
#define P2DC2                         572
#define P2DC3                         573
#define P2DC4                         574
#define P2DC5                         575
#define P2DC6                         576
#define P2RSEN                        577
#define PSS2BD                        578
#define PSS2BD0                       579
#define PSS2BD1                       580
#define PSS2AC0                       581
#define PSS2AC                        582
#define PSS2AC1                       583
#define CCP2AS0                       584
#define CCP2AS                        585
#define CCP2AS1                       586
#define CCP2AS2                       587
#define CCP2ASE                       588
#define PSTR2CON                      589
#define STR2A                         590
#define STR2B                         591
#define STR2C                         592
#define STR2D                         593
#define STR2SYNC                      594
#define CCPTMRS                       595
#define C1TSEL0                       596
#define C1TSEL                        597
#define C1TSEL1                       598
#define C2TSEL0                       599
#define C2TSEL                        600
#define C2TSEL1                       601
#define C3TSEL0                       602
#define C3TSEL                        603
#define C3TSEL1                       604
#define C4TSEL                        605
#define C4TSEL0                       606
#define C4TSEL1                       607
#define CCPR3L                        608
#define CCPR3H                        609
#define CCP3CON                       610
#define CCP3M                         611
#define CCP3M0                        612
#define CCP3M1                        613
#define CCP3M2                        614
#define CCP3M3                        615
#define DC3B                          616
#define DC3B0                         617
#define DC3B1                         618
#define CCPR4L                        619
#define CCPR4H                        620
#define CCP4CON                       621
#define CCP4M                         622
#define CCP4M0                        623
#define CCP4M1                        624
#define CCP4M2                        625
#define CCP4M3                        626
#define DC4B0                         627
#define DC4B                          628
#define DC4B1                         629
#define IOCBP                         630
#define IOCBP0                        631
#define IOCBP1                        632
#define IOCBP2                        633
#define IOCBP3                        634
#define IOCBP4                        635
#define IOCBP5                        636
#define IOCBP6                        637
#define IOCBP7                        638
#define IOCBN0                        639
#define IOCBN                         640
#define IOCBN1                        641
#define IOCBN2                        642
#define IOCBN3                        643
#define IOCBN4                        644
#define IOCBN5                        645
#define IOCBN6                        646
#define IOCBN7                        647
#define IOCBF0                        648
#define IOCBF                         649
#define IOCBF1                        650
#define IOCBF2                        651
#define IOCBF3                        652
#define IOCBF4                        653
#define IOCBF5                        654
#define IOCBF6                        655
#define IOCBF7                        656
#define CLKRCON                       657
#define CLKRDIV                       658
#define CLKRDIV0                      659
#define CLKRDIV1                      660
#define CLKRDIV2                      661
#define CLKRDC                        662
#define CLKRDC0                       663
#define CLKRDC1                       664
#define CLKRSLR                       665
#define CLKROE                        666
#define CLKREN                        667
#define MDCON                         668
#define MDBIT                         669
#define MDOUT                         670
#define MDOPOL                        671
#define MDSLR                         672
#define MDOE                          673
#define MDEN                          674
#define MDSRC                         675
#define MDMS0                         676
#define MDMS                          677
#define MDMS1                         678
#define MDMS2                         679
#define MDMS3                         680
#define MDMSODIS                      681
#define MDCARL                        682
#define MDCL0                         683
#define MDCL                          684
#define MDCL1                         685
#define MDCL2                         686
#define MDCL3                         687
#define MDCLSYNC                      688
#define MDCLPOL                       689
#define MDCLODIS                      690
#define MDCARH                        691
#define MDCH                          692
#define MDCH0                         693
#define MDCH1                         694
#define MDCH2                         695
#define MDCH3                         696
#define MDCHSYNC                      697
#define MDCHPOL                       698
#define MDCHODIS                      699
#define TMR4                          700
#define PR4                           701
#define T4CON                         702
#define T4CKPS0                       703
#define T4CKPS                        704
#define T4CKPS1                       705
#define TMR4ON                        706
#define T4OUTPS                       707
#define T4OUTPS0                      708
#define T4OUTPS1                      709
#define T4OUTPS2                      710
#define T4OUTPS3                      711
#define TMR6                          712
#define PR6                           713
#define T6CON                         714
#define T6CKPS0                       715
#define T6CKPS                        716
#define T6CKPS1                       717
#define TMR6ON                        718
#define T6OUTPS0                      719
#define T6OUTPS                       720
#define T6OUTPS1                      721
#define T6OUTPS2                      722
#define T6OUTPS3                      723
#define STATUS_SHAD                   724
#define C_SHAD                        725
#define DC_SHAD                       726
#define Z_SHAD                        727
#define WREG_SHAD                     728
#define BSR_SHAD                      729
#define PCLATH_SHAD                   730
#define FSR0L_SHAD                    731
#define FSR0H_SHAD                    732
#define FSR1L_SHAD                    733
#define FSR1H_SHAD                    734
#define STKPTR                        735
#define TOSL                          736
#define TOSH                          737

#endif // _PIC16F1827_H_
